/*********************************************************************************************************
* 模 块 名 称：RCC.h
* 摘        要：RCC模块，工作时钟的查询与分发
* 当前版本：1.0.0
* 作        者：SZLY(COPYRIGHT 2018 - 2026 SZLY. All rights reserved.)
* 生成日期：2026年09月20日
* 说        明：本文件由STM32F103版本移植而来
* 注        意：F103是在应用层手写ConfigRCC()配置72MHz；F407的168MHz系统时钟由启动
*               文件调用SystemInit()完成(配置在system_stm32f4xx.c中：HSE=8MHz，
*               PLL_M=8、N=336、P=2、Q=7)。因此本模块不再重复配时钟，只做
*               "锁相环是否真的锁定 + 各级总线频率查询"，供Timer/ADC计算分频使用
**********************************************************************************************************
* 取消版本：
* 作        者：
* 生成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _RCC_H_
#define _RCC_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define SYSCLK_HZ        (GetSysClockFreq())     //系统时钟(HZ)
#define APB1_TIMCLK_HZ   (GetAPB1TimClockFreq()) //APB1上定时器(TIM2~5,6~7,12~14)时钟(HZ)
#define APB2_TIMCLK_HZ   (GetAPB2TimClockFreq()) //APB2上定时器(TIM1,8~11)时钟(HZ)
#define ADCCLK_SRC_HZ    (GetAPB2ClockFreq())    //ADC时钟源(=PCLK2)频率(HZ)

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitRCC(void);         //初始化RCC模块

u32   GetSysClockFreq(void);         //获取系统时钟SYSCLK频率(HZ)
u32   GetAPB1TimClockFreq(void);     //获取APB1定时器时钟频率(HZ)
u32   GetAPB2TimClockFreq(void);     //获取APB2定时器时钟频率(HZ)
u32   GetAPB2ClockFreq(void);        //获取APB2总线(PCLK2)频率(HZ)
u8    IsRunByPLL(void);              //系统时钟源是否为PLL(1-是，0-否，PLL未锁定说明晶振异常)

#endif
